<?php namespace Bugcat\Lunar\Datas;

//文本數據
abstract class Text
{
    
    /**
     * The Simplified Chinese. 简体中文
     *
     * @const array
     */
    const CHS = [
        //错误信息
        'error' => [
            'limit' => '时间超出了范围 仅限本甲子(西历1984-02-01_23:00:00至2038-01-19_11:14:07)',
            'lang' => '配置了不被支持的语言',
        ],
        
        //数字
        'number' => ['零', '一', '二', '三', '四', '五', '六', '七', '八', '九'],
        'num_key' => [
            'ten' => '十',
            'hun' => '百',
            'tho' => '千',
            'wan' => '万',
            'yi'  => '亿',
        ],
        
        //纪元
        'ERA' => [
            'ZH' => '中华纪元',
            'XH' => '羲皇纪元',
        ],
        
        //天干
        'TG' => ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'],
        
        //地支
		'DZ' => ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'],
        
        //月份
        'M' => [ 1 => '正', '二', '三', '四', '五', '六', '七', '八', '九', '十', '冬', '腊'],
        
        //日期
        'D' => [1 => '初一', '初二', '初三', '初四', '初五', '初六', '初七', '初八', '初九', '初十', '十一', '十二', '十三', '十四', '十五', '十六', '十七', '十八', '十九', '二十', '廿一', '廿二', '廿三', '廿四', '廿五', '廿六', '廿七', '廿八', '廿九', '三十'],
        
        //杂项键
        'KEY' => [
            'Y'    => '年',
            'M'    => '月',
            'LEAP' => '闰',
            'KE'   => '刻',
        ],
    ];
    
    /**
     * Orthodox Chinese.  正體中文
     *
     * @const array
     */
    const CHO = [
        //錯誤信息
        'error' => [
            'limit' => '時間超出范圍：僅限本甲子(西曆1984-02-01_23:00:00至2038-01-19_11:14:07)',
            'lang' => '配置了不被支持的語言',
        ],
        
        //數字
        'number' => ['零', '一', '二', '三', '四', '五', '六', '七', '八', '九'],
        'num_key' => [
            'ten' => '十',
            'hun' => '百',
            'tho' => '千',
            'wan' => '萬',
            'yi'  => '億',
        ],
        
        //紀元
        'ERA' => [
            'ZH' => '中蕐紀元',
            'XH' => '羲皇紀元',
        ],
        
        //天干
        'TG' => ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'],
        
        //地支
		'DZ' => ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'],
        
        //月份
        'M' => [ 1 => '正', '二', '三', '四', '五', '六', '七', '八', '九', '十', '冬', '臘'],
        
        //日期
        'D' => [1 => '初一', '初二', '初三', '初四', '初五', '初六', '初七', '初八', '初九', '初十', '十一', '十二', '十三', '十四', '十五', '十六', '十七', '十八', '十九', '二十', '廿一', '廿二', '廿三', '廿四', '廿五', '廿六', '廿七', '廿八', '廿九', '三十'],
        
        //雜項鍵
        'KEY' => [
            'Y'    => '年',
            'M'    => '月',
            'LEAP' => '閏',
            'KE'   => '刻',
        ],
        
        
    ];
    
    
}
